#include <iostream>
#include <iomanip>
#include <cmath>

int main()
{

    ////////////////////////////////////////////////////////////////////
    // Приветствие
    std::cout << "Здравствуйте!\n";
    ////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////
    //	Начало задачи 1
    long int x = 0;
    std::cout << "Введите x\n";
    std::cin >> x;

    double result1 = (double) 3*pow(x,5)+2*pow(x,3)+1;
    std::cout << "Ответ:\n";
    std::cout << "3*pow(x,5)+2*pow(x,3)+1 = " << std::setprecision(3) << result1;
    //	Конец задачи 1
    ////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////
    //	Начало задачи 2
    unsigned int a = 0; // В при любых целых $а прин. [0;2**32-1]
    std::cout << "\nВведите a\n";
    std::cin >> a;

    double result2 = 5*pow(3*a-2,0.5)-4*abs(a);
    std::cout << "Ответ:\n";
    std::cout << "5*pow(3*a-2,0.5)-4*abs(a) = "<< std::showpos << result2;
    //	Конец задачи 2
    ////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////
    //	Начало задачи 3
    bool k = 0, l = 0, m = 0, n = 0;
    std::cout << "\nВведите k, l, m, n, разделяя их пробелами\n";
    std::cin >> k >> l >> m >> n;

    bool result3 = l||(((m&&!n)||(!m&&n))&&(!k));
    std::cout << "Ответ:\n";
    std::cout << "l||(m&&!n||!m&&n)&&!k = " << std::boolalpha << result3;
    //	Конец задачи 3
    ////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////
    //	Начало задачи 4
    long int b = 0;
    std::cout << "\nВведите b \n";
    std::cin >> b;

    long int result4 = 1;
    result4 <<= b ; // сдвиг 1 влево

    std::cout << "Ответ:\n";
    std::cout << "2**b = в десятичной СС " << std::dec << result4 << " и в восьмеричной " << std::oct << result4;
    //	Конец задачи 4
    ////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////
    //	Начало задачи 5
    unsigned char f = 0, d = 0, c = 0, e = 0;
    std::cout << "\nВведите числа f, d, c, e, разделяя их пробелом.\n";
    std::cin >> f >> d >> c >> e;

    unsigned char result5 = (~( f | d )) & (( (~c) & e )|( (~e) & c ));

    std::cout << "Ответ:\n";
    std::cout << "(~(f|d))&(((~c)&e)|((~e)&c)) = "<< std::hex << result5;
    //	Конец задачи 5
    ////////////////////////////////////////////////////////////////////
    return 0;
}
